_posts/2014-09-12-definition.html


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">process pair<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></h2>
<div class="outline-text-2" id="text-1">
<p>
Tandem's system created process pairs consisting of a primary
process and a backup process. First, the primary process would
begin, then clone itself elsewhere as a backup. Guardian would send
an initial message to the backup process, "telling" the process its
status as a backup. Finally, the backup would become passive and
accept messages from either Guardian or the primary process. When an
error occurred, Guardian would automatically re-route a message from
a failing component to a functioning one. Checkpointing and
synchronization were important to maintain "uptimes" measured in
years, as opposed to the typical systems of the day that failed
every few days.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">high availablility</h2>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">fault toleration</h2>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">past-the-end</h2>
<div class="outline-text-2" id="text-4">
<p>
According to the c++ reference<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup> 
In all the c++ containers, they include a member function
function iterator end(), and the function returns an iterator
referring to the past-the-end element in the set container.
</p>

<p>
The past-the-end element is the theoretical element that would follow
the last element in the set container. It does not point to any
element, and thus shall not be dereferenced.
</p>

<p>
past-the-end 的中文意思是： 在 终点/结尾/最后 之后。或紧随终点/结尾/最
后。
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Pattern matching</h2>
<div class="outline-text-2" id="text-5">
<p>
Pattern matching consists of specifying patterns to which some data
should conform and then checking to see if it does and deconstructing
the data according to those patterns. Reference "Learning You a Haskell"
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Fault Tolerance in Tandem Computer Systems
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
<a href="http://www.cplusplus.com/reference/set/set/end/">http://www.cplusplus.com/reference/set/set/end/</a>
</p></div>


</div>
</div>
